Task1_2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)     // V0
    (1 0 0)     // V1
    (2 1 0)     // V2
    (1 1 0)     // V3
    (0 1 0)     // V4
    (-1 1 0)    // V5
    (2 2 0)     // V6
    (1 2 0)     // V7
    (0 2 0)     // V8
    (-1 2 0)    // V9
    (1 3 0)     // V10
    (0 3 0)     // V11
    (0 0 0.1)   // V12
    (1 0 0.1)   // V13
    (2 1 0.1)   // V14
    (1 1 0.1)   // V15
    (0 1 0.1)   // V16
    (-1 1 0.1)  // V17
    (2 2 0.1)   // V18
    (1 2 0.1)   // V19
    (0 2 0.1)   // V20
    (-1 2 0.1)  // V21
    (1 3 0.1)   // V22
    (0 3 0.1)   // V23
);

blocks
(
    hex (0 1 3 4 12 13 15 16) (40 18 1) 
    simpleGrading 
    (1 
    (-4)
     1)
    hex (3 2 6 7 15 14 18 19) (18 40 1)
     simpleGrading 
      (4 1 1)
    hex (4 3 7 8 16 15 19 20) (40 40 1) 
    simpleGrading 
    (1 1 1)
    hex (5 4 8 9 17 16 20 21) (18 40 1) 
    simpleGrading 
    (-4 1 1)
    hex (8 7 10 11 20 19 22 23) (40 18 1) 
    simpleGrading 
    (1 4 1)
);

edges
(
);

boundary
(
    /* movingWall
    {
        type wall;
        faces
        (
    
            
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            
        );
    } */

);


// ************************************************************************* //
